update/sys_soap_message_function_6b60d7dadb63f60075ea38ff9d961939.xml

<?xml version="1.0" encoding="UTF-8"?>
<record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type>basic</authentication_type>
        <basic_auth_password/>
        <basic_auth_profile display_value="Oasis Web Service">bd275793db367a00d596327e9d9619e2</basic_auth_profile>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://www.delphi-tech.com/ows/PartyInquiryService">
   <soapenv:Header/>
   <soapenv:Body>
      <par:PartyInquiryRequest>
         <!--Optional:-->
         <par:MessageId>${PartyInquiryRequest.MessageId}</par:MessageId>
         <!--Optional:-->
         <par:CorrelationId>${PartyInquiryRequest.CorrelationId}</par:CorrelationId>
         <par:UserId>${PartyInquiryRequest.UserId}</par:UserId>
         <!--1 or more repetitions:-->
         <par:PartyInquiryRequestParameters>
            <par:PartyInquiry>
               <par:Party>
                  <!--Optional:-->
                  <par:PartyName>
                     <par:FullName>${PartyName.FullName}</par:FullName>
                  </par:PartyName>
                  <!--Optional:-->
                  <par:PartyNumberId>${Party.PartyNumberId}</par:PartyNumberId>
                  <!--Optional:-->
                  <par:ClientId>${Party.ClientId}</par:ClientId>
                  <!--Optional:-->
                  <par:ExternalReferenceId>${Party.ExternalReferenceId}</par:ExternalReferenceId>
               </par:Party>
            </par:PartyInquiry>
         </par:PartyInquiryRequestParameters>
         <!--Optional:-->
         <par:PartyInquiryResultParameters>
            <!--Zero or more repetitions:-->
            <par:ViewName>${PartyInquiryResultParameters.ViewName}</par:ViewName>
            <!--Optional:-->
            <par:ResolveCodes>${PartyInquiryResultParameters.ResolveCodes}</par:ResolveCodes>
         </par:PartyInquiryResultParameters>
      </par:PartyInquiryRequest>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>partyInquiryRequest</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>CAM-OASIS-PartyInquiryService [ partyInquiryRequest ]</qualified_name>
        <soap_action>partyInquiryRequest</soap_action>
        <soap_endpoint>http://oasisdev.norcalmutual.com:8080/dev/eCIS/wsCIS/PartyInquiryService</soap_endpoint>
        <soap_message display_value="CAM-OASIS-PartyInquiryService">b5fdcb5edb63f60075ea38ff9d9619dc</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>rrao</sys_created_by>
        <sys_created_on>2017-06-26 20:39:25</sys_created_on>
        <sys_customer_update>false</sys_customer_update>
        <sys_id>6b60d7dadb63f60075ea38ff9d961939</sys_id>
        <sys_mod_count>14</sys_mod_count>
        <sys_name>partyInquiryRequest</sys_name>
        <sys_package display_value="Medical Claim Management" source="x_norca_med_cam">4427741adb53fe8023cdd92b5e961942</sys_package>
        <sys_policy/>
        <sys_replace_on_upgrade>false</sys_replace_on_upgrade>
        <sys_scope display_value="Medical Claim Management">4427741adb53fe8023cdd92b5e961942</sys_scope>
        <sys_update_name>sys_soap_message_function_6b60d7dadb63f60075ea38ff9d961939</sys_update_name>
        <sys_updated_by>jpolk</sys_updated_by>
        <sys_updated_on>2017-10-26 19:13:08</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server display_value="">b755df81dbc04300d596327e9d961980</use_mid_server>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
